категории_цехов = [2, 2, 2, 2, 2, 2, 3, 2, 2, 2, 3, 3, 2, 2, 2]
количество_цехов = 15
количество_трансформаторов = [2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 0, 0, 2, 2, 2]
длины_линий = [19, 38, 63, 144, 138, 94, 69, 219, 238, 238, 94, 56, 398, 200, 150]
сечения_кабелей = [16, 25, 35, 50, 70, 95, 120, 150, 185, 240]
число_часов_работы_предприятия = 2500
т_в = 8760
стоимость_квт_электроэнергии = 3
коэффициент_амортизационных_отчислений = 0.03
коэффициент_амортизационных_отчислений_выключатель = 0.06
коэффициент_амортизационных_отчислений_тп = 0.06
координаты_гпп = (0, 150)
координаты_цехов = [
    (19, 163),
    (19, 119),
    (19, 69),
    (50, 200),
    (150, 144),
    (88, 150),
    (263, 169),
    (125, 206),
    (206, 169),
    (231, 81),
    (250, 38),
    (231, 81),
    (188, 131),
    (75, 50),
    (10, 20),
]

l_delta_u1percent = [
    95.1,  # 16
    148.6,  # 25,
    208.1,  # 35,
    297.3,  # 50,
    416.2,  # 70,
    564.9,  # 95,
    713.5,  # 120,
    892,  # 150,
    1100,  # 185,
    1427,  # 240
]

коэффициенты_спроса = [
    0.7,
    0.5,
    0.25,
    0.6,
    0.35,
    0.5,
    0.4,
    0.78,
    0.35,
    0.7,
    0.35,
    0.4,
    0.4,
    0.5,
    0.4,
]

cos_fi = [
    0.75,
    0.7,
    0.7,
    0.75,
    0.6,
    0.75,
    0.8,
    0.8,
    0.75,
    0.75,
    0.75,
    0.8,
    0.7,
    0.8,
    0.7,
]
