enterprise_powers = [
    760,
    1240,
    470,
    580,
    260,
    560,
    80,
    450,
    520,
    680,
    450,
    110,
    520,
    460,
    360,
]

transformers_types = [
    "масляный",
    "масляный",
    "масляный",
    "масляный",
    "масляный",
    "масляный",
    "масляный",
    "масляный",
    "масляный",
    "масляный",
    "масляный",
    "масляный",
    "масляный",
    "масляный",
    "масляный",
]

# transformers_prices = [
#     316,
#     316,
#     135,
#     150,
#     80,
#     135,
#     0,
#     135,
#     135,
#     150,
#     0,
#     0,
#     135,
#     150,
#     135,
# ]

transformers_prices = [117, 157, 206, 316, 454, 634, 780, 880]


nominal_powers_of_transformers = [160, 250, 400, 630, 1000, 1600, 2500]

delta_p_xx_tm = [0.55, 0.83, 1.05, 1.50, 2.60, 2.80, 4.20]
delta_p_xx_tsz = [0.95, 1.30, 1.75, 2.20, 3.10, 4.80, 4.80]
delta_p_kz_tm = [2.60, 3.70, 4.60, 6.50, 10.50, 17.00, 24.00]
delta_p_kz_tsz = [2.30, 3.20, 4.60, 6.60, 10.80, 15.60, 12.00]
# для расчета Ixx
i_xx_tm = [1.9, 1.9, 2.0, 1.8, 1.2, 1.0, 0.8]
i_xx_tsz = [2.0, 1.7, 1.4, 1.2, 0.9, 0.8, 0.75]
u_kz_tm = [4.7, 4.7, 4.5, 5.5, 5.5, 6.0, 6.0]
u_kz_tsz = [4.0, 4.0, 4.0, 4.0, 6.0, 6.0, 6.0]
price_tm = [117000, 157000, 206000, 316000, 454000, 634000, 780000]
price_tsz = [438000, 676000, 742000, 874000, 1099000, 1444320, 2027240]



